afrab/WSim/arch/msp430/msp430_alu.c

/**
 *  \file   msp430_alu.c
 *  \brief  MSP430 ALU emulation 
 *  \author Antoine Fraboulet
 *  \date   2005
 *
 *  All rights reserved 
 **/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <assert.h>

#include "arch/common/hardware.h"
#include "msp430.h"

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/**
 * global variables used in this file
 *
 * static struct msp430_op_type1 opt1;
 * static struct msp430_op_type2 opt2;
 *
 */ 


// SR/GIE state change debug message
#define DEBUG_ME_HARDER 0

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/** 
 * status register (register 2)
 *
 *         5 4 3 2 1 0 9 8 7 6 5 4 3 2 1 0
 * SR (2) [  reserved   |v|x|x|x|x|x|n|z|c]
 *
 *  8 : v       overflow bit
 *  7 : scg1    system clock generator 1
 *  6 : scg0    system clock generator 0
 *  5 : oscoff  oscillator off
 *  4 : cpuoff  cpu off
 *  3 : gie     general interrupt enable
 *  2 : n       negative bit
 *  1 : z       zero bit
 *  0 : c       carry bit
 **/

#define SET_V        SR |= 0x0100
#define SET_N        SR |= 0x0004
#define SET_Z        SR |= 0x0002
#define SET_C        SR |= 0x0001

#define CLR_V        SR &= ~0x0100
#define CLR_N        SR &= ~0x0004
#define CLR_Z        SR &= ~0x0002
#define CLR_C        SR &= ~0x0001

#define WRITE_V(b)   if (b) { SET_V; } else { CLR_V; }
#define WRITE_N(b)   if (b) { SET_N; } else { CLR_N; }
#define WRITE_Z(b)   if (b) { SET_Z; } else { CLR_Z; }
#define	WRITE_C(b)   if (b) { SET_C; } else { CLR_C; }

#define READ_V       ((uint16_t)(SR & 0x0100) >> 8)
#define READ_N       ((uint16_t)(SR & 0x0004) >> 2)
#define READ_Z       ((uint16_t)(SR & 0x0002) >> 1)
#define	READ_C       ((uint16_t)(SR & 0x0001) >> 0)

/************************/
/* MSP430 MACHINE       */
/************************/

inline uint16_t mcu_get_pc(void)
{
  return MCU_ALU.regs[PC_REG_IDX];
}

inline uint16_t mcu_get_pc_next(void)
{
  return MCU_ALU.next_pc;
}

inline void mcu_set_pc_next(uint16_t x)
{
  /* next instruction */
  MCU_ALU.next_pc = x;
}

inline void msp430_alu_reset(void)
{
  int i;
  for(i=0; i < MCU_REGISTERS; i++) 
    {
      MCU_ALU.regs[i] = 0;
    }

  MCU_ALU.regs[PC_REG_IDX] = msp430_read_short(0xFFFEu);
  MCU_ALU.next_pc          = MCU_ALU.regs[PC_REG_IDX]; 
  SR = 0;

  MCU_ALU.interrupt_vector = 0;
  MCU_ALU.signal           = 0;
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

/**
 *   MSP340 Instruction set architecture (ISA)   [slau056e.pdf, 3-19]
 *
 * Type 1 : double operands
 * Type 2 : single operand
 * Type 3 : jumps
 *   
 *         1 1 1 1 1 1 
 *         5 4 3 2 1 0 9 8 7 6 5 4 3 2 1 0
 *
 * T1     [  op   | sreg  |x|b| as| dreg  ] x=ad
 *
 * T2     [  op             |b| ad| d/sreg]
 *
 * T3     [  op |  cc |       offset      ]
 *
 *        [       |       |        |      ]
 *
 * T1   opcode on 4 bits   = b15=x & b14=x & b15 | b14 true
 * T3   opcode on 3 bits   = b15=0 & b14=0 & b13 = 1
 * T2   opcode on          = b15=0 & b14=0 & b13 = 0
 * 
 **/ 

/** 
 * type 1 : double operand
 **/
#define OP_MOV	    0x4 // 0100
#define OP_ADD	    0x5 // 0101
#define OP_ADDC	    0x6 // 0110
#define OP_SUBC	    0x7 // 0111
#define OP_SUB	    0x8 // 1000
#define OP_CMP	    0x9 // 1001
#define OP_DADD	    0xa // 1010
#define OP_BIT	    0xb // 1011
#define OP_BIC	    0xc // 1100
#define OP_BIS	    0xd // 1101
#define OP_XOR	    0xe // 1110
#define OP_AND	    0xf // 1111

/**
 * type 2 : single operand
 * not right shifted to avoid collisions with type 3
 **/
#define OP_SXT	  0x118 // 0001 0001 1000
#define OP_CALL   0x128 // 0001 0010 1000
#define OP_RETI   0x130 // 0001 0011 0000
#define OP_PUSH   0x120 // 0001 0010 0000
#define OP_SWPB   0x108 // 0001 0000 1000
#define OP_RRA	  0x110 // 0001 0001 0000
#define OP_RRC	  0x100 // 0001 0000 0000

/**
 * type 3 : 2 bits + 2 bits 
 *
 * 0011 11 0 ... 0
 *        | 10 bits
 **/
#define OP_JNZ	   0x20 // 0010 0000
#define OP_JZ	   0x24 // 0010 0100
#define OP_JNC	   0x28 // 0010 1000
#define OP_JC	   0x2c // 0010 1100
#define OP_JN	   0x30 // 0011 0000
#define OP_JGE	   0x34 // 0011 0100
#define OP_JL	   0x38 // 0011 1000
#define OP_JMP	   0x3c // 0011 1100

static inline unsigned int extract_opcode(uint16_t insn)
{
  unsigned int tmp;

  tmp = (insn >> 12) & 0x0f; // 4 bits

  /* HW_DMSG_DIS("PC:0x%04x ins:0x%04x  ",mcu_get_pc() & 0xffff,insn & 0xffff); */
  
  /* type 1 = double operands : opcode 4 bits */
  if ((tmp & 0xc) != 0x0) 
    {
      return tmp;
    }
  /* type 3 = jumps : opcode 3 bits */
  if ((tmp & 0x2) == 0x2) 
    {
      return ((unsigned int)insn >> 8) & ~3;
    }
  /* type 2 = single operands or SIGTRAP x */
  return (insn >> 4) & ~7;
}

/***********************/
/*                     */
/***********************/

#if ETRACE
#define ETRACER_SET_JUMP_TYPE(x)  MCU_ALU.etracer_branch_type    = x
#define ETRACER_BRANCH(x)         MCU_ALU.etracer_branch_type    = x


static inline int msp430_insn_class(int opcode)
{
  switch (opcode)
    {
      /** 
       * type 1 : double operand
       **/
    case OP_MOV	    : return ETRACER_INSN_CLASS_1;
    case OP_ADD	    : return ETRACER_INSN_CLASS_1;
    case OP_ADDC    : return ETRACER_INSN_CLASS_1;
    case OP_SUBC    : return ETRACER_INSN_CLASS_1;
    case OP_SUB	    : return ETRACER_INSN_CLASS_1;
    case OP_CMP	    : return ETRACER_INSN_CLASS_1;
    case OP_DADD    : return ETRACER_INSN_CLASS_1;
    case OP_BIT	    : return ETRACER_INSN_CLASS_1;
    case OP_BIC	    : return ETRACER_INSN_CLASS_1;
    case OP_BIS	    : return ETRACER_INSN_CLASS_1;
    case OP_XOR	    : return ETRACER_INSN_CLASS_1;
    case OP_AND	    : return ETRACER_INSN_CLASS_1;

      /**
       * type 2 : single operand
       * not right shifted to avoid collisions with type 3
       **/
    case OP_SXT     : return ETRACER_INSN_CLASS_1;
    case OP_CALL    : return ETRACER_INSN_CLASS_1;
    case OP_RETI    : return ETRACER_INSN_CLASS_1;
    case OP_PUSH    : return ETRACER_INSN_CLASS_1;
    case OP_SWPB    : return ETRACER_INSN_CLASS_1;
    case OP_RRA	    : return ETRACER_INSN_CLASS_1;
    case OP_RRC	    : return ETRACER_INSN_CLASS_1;

      /**
       * type 3 : 2 bits + 2 bits 
       *
       * 0011 11 0 ... 0
       *        | 10 bits
       **/
    case OP_JNZ	    : return ETRACER_INSN_CLASS_1;
    case OP_JZ	    : return ETRACER_INSN_CLASS_1;
    case OP_JNC	    : return ETRACER_INSN_CLASS_1;
    case OP_JC	    : return ETRACER_INSN_CLASS_1;
    case OP_JN	    : return ETRACER_INSN_CLASS_1;
    case OP_JGE	    : return ETRACER_INSN_CLASS_1;
    case OP_JL	    : return ETRACER_INSN_CLASS_1;
    case OP_JMP	    : return ETRACER_INSN_CLASS_1;
    }

