afrab/WSim/arch/msp430/msp430_alu.c
  return 0;
}

#else
#define ETRACER_SET_JUMP()       do { } while (0)
#define ETRACER_SET_JUMP_TYPE(x) do { } while (0)
#define ETRACER_BRANCH(x)        do { } while (0)
#define msp430_insn_class(x)     do { } while (0)
#endif

/******************************************************************************************/
/** TYPE 1 DOUBLE OPERANDS ****************************************************************/
/******************************************************************************************/

/**
 * Information used during a type 1 operation (double operands)
 **/
struct msp430_op_type1
{
  uint8_t  as;         /* source addressing bits  */
  uint8_t  ad;         /* dest addressing bits    */

  uint8_t  src_reg;    /* source register         */
  uint8_t  dst_reg;    /* dest register           */

  int16_t  src_val;    /* source value            */
  uint16_t dst_addr;   /* dest address (mode = 1) */

#define CST_MODE 0
#define MEM_MODE 1 
#define REG_MODE 2

  uint8_t  byte;       /* operand size            */
  uint8_t  dst_mode;   /* dest mode 0:reg 1:mem   */


#define SRC_TIMING_0 0
#define SRC_TIMING_1 1
#define SRC_TIMING_2 2
#define SRC_TIMING_3 3

#define DST_TIMING_0 0
#define DST_TIMING_1 1
#define DST_TIMING_2 2

  uint8_t  src_t_mode; /* src cycle timing mode   */
  uint8_t  dst_t_mode; /* dst cycle timing mode   */

};


#if DEBUG_DISASSEMBLE
#define ASM_LENGTH      50
#define ASM_VAR()       char asm_str[ASM_LENGTH];
#define ASM_START(insn)				\
  do {						\
    sprintf(asm_str,				\
	 "msp430: PC:0x%04x ins:0x%04x  ",	\
         mcu_get_pc() & 0xffff,insn & 0xffff);	\
  } while (0)
#define ASM_ADD(s...)				\
  do {						\
    char asm_buff[ASM_LENGTH];			\
    sprintf(asm_buff,s);			\
    strncat(asm_str,asm_buff,ASM_LENGTH);	\
  } while (0)
#define ASM_END()				\
  do {						\
    HW_DMSG_DIS(asm_str);			\
  } while (0)
#else
#define ASM_VAR()       do { } while (0)
#define ASM_START(insn) do { } while (0)
#define ASM_ADD(s...)   do { } while (0)
#define ASM_END()       do { } while (0)
#endif

/**
 * global variable used for type1 operations
 **/
static struct msp430_op_type1 opt1;

#define READ_SRC(byte,offset) ((byte) ? msp430_read_byte( offset ) & 0xff : msp430_read_short( offset ))

/** 
 * opt1 structure decode from instruction 
 **/

static void msp430_type1_double_operands(uint16_t insns)
{
  ASM_VAR();
  uint16_t decode_next_pc;
  uint16_t s_offset;

  /*         5 4 3 2 1 0 9 8 7 6 5 4 3 2 1 0       */
  /* T1     [  op   | sreg  |x|b| as| dreg  ] x=ad */
  
  opt1.dst_reg = (insns >> 0) & 0xf;
  opt1.as      = (insns >> 4) & 0x3;
  opt1.byte    = (insns >> 6) & 0x1;
  opt1.ad      = (insns >> 7) & 0x1;
  opt1.src_reg = (insns >> 8) & 0xf;

  ASM_START(insns);
  ASM_ADD("%s ",msp430_debug_opcode(insns >> 12,opt1.byte));

  decode_next_pc = mcu_get_pc() + 2;

  /*****************/
  /** source      **/
  /*****************/

  switch (opt1.as)
    {
    case 0x0: /* sreg register */
      switch (opt1.src_reg)
	{
	case PC_REG_IDX:
	  opt1.src_val    = decode_next_pc;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("%s,",mcu_regname_str(opt1.src_reg));
	  break;
	case CG2_REG_IDX:
	  opt1.src_val    = 0x0000;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#0,");
	  break;
	default:
	  opt1.src_val    = MCU_ALU.regs[opt1.src_reg];
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("%s,",mcu_regname_str(opt1.src_reg));
	  break;
	}
      break;

    case 0x1: /* source is indexed on sreg */
      switch (opt1.src_reg)
	{
	case PC_REG_IDX: /* symbolic : [ PC+2 ] + PC */
	  s_offset        = msp430_read_short( decode_next_pc ) + decode_next_pc;
	  opt1.src_val    = msp430_read_short( s_offset );
	  opt1.src_t_mode = SRC_TIMING_3;
	  decode_next_pc += 2;
	  ASM_ADD("0x%04x,",opt1.src_val & 0xffff);
	  break;
	case CG1_REG_IDX: /* absolute */
	  s_offset        = msp430_read_short( decode_next_pc );
 	  opt1.src_val    = READ_SRC( opt1.byte, s_offset );
	  opt1.src_t_mode = SRC_TIMING_3;
	  decode_next_pc += 2;
	  ASM_ADD("&0x%04x,",s_offset & 0xffff);
	  break;
	case CG2_REG_IDX: /* CG2 == +1 */
	  opt1.src_val    = 0x0001;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#1,");
	  break;
	default:          /* index */
	  {
	    uint16_t off    = msp430_read_short( decode_next_pc );
	    s_offset        = off + MCU_ALU.regs[opt1.src_reg];
	    ASM_ADD("%d(%s),", off & 0xffff, mcu_regname_str(opt1.src_reg));
	    opt1.src_val    = READ_SRC(opt1.byte,s_offset);
	    opt1.src_t_mode = SRC_TIMING_3;
	    decode_next_pc += 2;
	  }
	  break;
	}
      break;

    case 0x2: /* source is indirect @Rn */
      switch (opt1.src_reg)
	{
	case PC_REG_IDX: /* [PC + 2] */
	  s_offset        = decode_next_pc;
	  opt1.src_val    = READ_SRC(opt1.byte, s_offset);
	  opt1.src_t_mode = SRC_TIMING_1;
	  ASM_ADD("@%s,",mcu_regname_str(opt1.src_reg));
	  break;
	case CG1_REG_IDX: /* CG1 == +4 */
	  opt1.src_val    = 0x0004;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#4,");
	  break;
	case CG2_REG_IDX: /* CG2 == +2 */
	  opt1.src_val    = 0x0002;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#2,");
	  break;
	default:
	  s_offset        = MCU_ALU.regs[opt1.src_reg];
	  opt1.src_val    = READ_SRC(opt1.byte, s_offset);
	  opt1.src_t_mode = SRC_TIMING_1;
	  ASM_ADD("@%s,",mcu_regname_str(opt1.src_reg));
	  /* ASM_ADD(" [reg = %x],", s_offset); */
	  break;
	}
      break;

    case 0x3: /* source is indirect increment */
      switch (opt1.src_reg)
	{
	case PC_REG_IDX: /* [PC + 2] */
	  s_offset        = decode_next_pc; 
	  opt1.src_val    = READ_SRC(opt1.byte,s_offset);
	  opt1.src_t_mode = SRC_TIMING_2;
	  decode_next_pc += 2;
	  ASM_ADD("#%d,",opt1.src_val);
	  break;

	case CG1_REG_IDX:
	  opt1.src_val    = 0x0008;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#8,");
	  break;

	case CG2_REG_IDX:
	  opt1.src_val    = 0xffff;
	  opt1.src_t_mode = SRC_TIMING_0;
	  ASM_ADD("#-1,");
	  break;

	default:
	  s_offset        = MCU_ALU.regs[opt1.src_reg];
	  opt1.src_val    = READ_SRC(opt1.byte,s_offset);
	  opt1.src_t_mode = SRC_TIMING_2;
	  MCU_ALU.regs[opt1.src_reg] += opt1.byte ? 1 : 2;
	  ASM_ADD("@%s+,",mcu_regname_str(opt1.src_reg));
	  break;
	}
      break;
    }
  
  /*****************/
  /** destination **/
  /*****************/

  switch (opt1.ad)
    {
    case 0x0: /* dreg register   */
      opt1.dst_mode   = REG_MODE;
      opt1.dst_t_mode = DST_TIMING_0;
      /* opt1.dst_reg is already set */
      ASM_ADD("%s",mcu_regname_str(opt1.dst_reg));
      break;
    case 0x1: /* indexed on dreg */
      opt1.dst_mode   = MEM_MODE;
      switch (opt1.dst_reg)
	{
	case PC_REG_IDX: /* symbolic */ 
	  opt1.dst_addr   = msp430_read_short( decode_next_pc ) + decode_next_pc ; 
	  opt1.dst_t_mode = DST_TIMING_2;
	  ASM_ADD("0x%04x",opt1.dst_addr & 0xffff);
	  break;
	case SR_REG_IDX: /* absolute */
	  opt1.dst_addr   = msp430_read_short( decode_next_pc );
	  opt1.dst_t_mode = DST_TIMING_2;
	  ASM_ADD("&0x%04x",opt1.dst_addr & 0xffff);
	  break;
	default:         /* index */
	  opt1.dst_addr   = msp430_read_short( decode_next_pc ) + MCU_ALU.regs[opt1.dst_reg];
	  opt1.dst_t_mode = DST_TIMING_2;
	  ASM_ADD("%d(%s)",msp430_read_short( decode_next_pc ) & 0xffff,
	          mcu_regname_str(opt1.dst_reg));
	  break;
	}
      decode_next_pc += 2;
      break;
    }

  /***********************/
  /** operands complete **/
  /***********************/

