afrab/WSim/arch/msp430/msp430_alu.c
  ASM_ADD("\n");
  ASM_END();

  mcu_set_pc_next(decode_next_pc);
#if defined(ETRACE)
  MCU_ALU.sequ_pc = decode_next_pc;
#endif
}

/******************************************************************************************/
/** TYPE 2 SINGLE OPERAND *****************************************************************/
/******************************************************************************************/

/**
 * Information used during a type 2 operation (single operands)
 **/
struct msp430_op_type2
{
  uint8_t  byte;  /* operand size                           */
  uint8_t  ad;    /* adressing bits                         */
  uint8_t  mode;  
  uint8_t  reg;   /* destination/source register            */

  uint16_t addr;  /* destination/source addr if mode == MEM */
  int16_t  val;   /* destination/source value               */

#define OPT2_TIMING_0 0
#define OPT2_TIMING_1 1
#define OPT2_TIMING_2 2
#define OPT2_TIMING_3 3
#define OPT2_TIMING_4 4

  uint8_t  t_mode;/* timing mode                            */

};

/**
 * global variable used for type2 operations
 **/
static struct msp430_op_type2 opt2;

/** 
 * opt2 structure decode from instruction 
 **/
static void msp430_type2_single_operand(uint16_t insns)
{
  ASM_VAR();
  uint16_t decode_next_pc;
  /*         5 4 3 2 1 0 9 8 7 6 5 4 3 2 1 0  */
  /* T2     [  op             |b| ad| dsreg ] */

  opt2.reg  = (insns >> 0) & 0xf;
  opt2.ad   = (insns >> 4) & 0x3;
  opt2.byte = (insns >> 6) & 0x1;
  
  ASM_START(insns);
  ASM_ADD("%s ",msp430_debug_opcode((insns >> 4) & ~7,opt2.byte));

  decode_next_pc = mcu_get_pc() + 2;

  switch (opt2.ad)
    {
    case 0x0: /* sreg register */
      switch (opt2.reg)
	{
	case PC_REG_IDX:
	  opt2.mode   = REG_MODE;
	  opt2.val    = decode_next_pc;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("%s",mcu_regname_str(opt2.reg));
	  break;
	case CG2_REG_IDX:
	  opt2.mode   = CST_MODE;
	  opt2.val    = 0x0000;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#0");
	  break;
	default:
	  opt2.mode   = REG_MODE;
	  opt2.val    = MCU_ALU.regs[opt2.reg];
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("%s",mcu_regname_str(opt2.reg));
	  break;
	}
      break;

    case 0x1:
      switch (opt2.reg)
	{
	case PC_REG_IDX: /* symbolic */ 
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = msp430_read_short( decode_next_pc ) + decode_next_pc ; // MCU_ALU.regs[opt2.reg];
	  opt2.val    = msp430_read_short( opt2.addr );
	  opt2.t_mode = OPT2_TIMING_4;
	  decode_next_pc += 2;
	  ASM_ADD("0x%04x",opt2.addr & 0xffff);
	  break;
	case CG1_REG_IDX: /* absolute */
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = msp430_read_short( decode_next_pc );
 	  opt2.val    = READ_SRC(opt2.byte,opt2.addr);
	  opt2.t_mode = OPT2_TIMING_4;
	  decode_next_pc += 2;
	  ASM_ADD("&0x%04x",opt2.addr & 0xffff);
	  break;
	case CG2_REG_IDX: /* CG2 == +1 */
	  opt2.mode   = CST_MODE;
	  opt2.val    = 0x0001;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#1");
	  break;
	default:          /* index */
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = msp430_read_short( decode_next_pc ) + MCU_ALU.regs[opt2.reg];
 	  opt2.val    = READ_SRC(opt2.byte,opt2.addr);
	  opt2.t_mode = OPT2_TIMING_4;
	  decode_next_pc += 2;
	  ASM_ADD("%d(%s)",msp430_read_short( decode_next_pc ) & 0xffff,mcu_regname_str(opt2.reg));
	  break;
	}
      break;

    case 0x2:
      switch (opt2.reg)
	{
	case PC_REG_IDX:
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = decode_next_pc;
	  opt2.val    = READ_SRC(opt2.byte,opt2.addr);
	  opt2.t_mode = OPT2_TIMING_1;
	  ASM_ADD("@%s",mcu_regname_str(opt2.reg));
	  break;
	case CG1_REG_IDX: /* CG1 == +4 */
	  opt2.mode   = CST_MODE;
	  opt2.val    = 0x0004;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#4");
	  break;
	case CG2_REG_IDX: /* CG2 == +2 */
	  opt2.mode   = CST_MODE;
	  opt2.val    = 0x0002;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#2");
	  break;
	default:  /* indirect */
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = MCU_ALU.regs[opt2.reg];
	  opt2.val    = READ_SRC(opt2.byte,opt2.addr);
	  opt2.t_mode = OPT2_TIMING_1;
	  ASM_ADD("@%s",mcu_regname_str(opt2.reg));
	  break;
	}
      break;

    case 0x3:
      switch (opt2.reg)
	{
	case PC_REG_IDX: /* immediate */
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = decode_next_pc; // MCU_ALU.regs[opt2.reg];
	  opt2.val    = msp430_read_short( opt2.addr );
	  opt2.t_mode = OPT2_TIMING_3;
	  decode_next_pc += 2;
	  ASM_ADD("#%d",opt2.val & 0xffff);
	  break;
	case CG1_REG_IDX:
	  opt2.mode   = CST_MODE;
	  opt2.val    = 0x0008;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#8");
	  break;
	case CG2_REG_IDX:
	  opt2.mode   = CST_MODE; 
	  opt2.val    = 0xffff;
	  opt2.t_mode = OPT2_TIMING_0;
	  ASM_ADD("#-1");
	  break;
	default:  /* indirect autoincrement */
	  opt2.mode   = MEM_MODE;
	  opt2.addr   = MCU_ALU.regs[opt2.reg];
	  opt2.val    = READ_SRC(opt2.byte,opt2.addr);
	  opt2.t_mode = OPT2_TIMING_2;
	  MCU_ALU.regs[opt2.reg] += opt2.byte ? 1 : 2;
	  ASM_ADD("@%s+",mcu_regname_str(opt2.reg));
	  break;
	}
      break;
    }

  ASM_ADD("\n");
  ASM_END();

  mcu_set_pc_next(decode_next_pc);
#if defined(ETRACE)
  MCU_ALU.sequ_pc = decode_next_pc;
#endif
}

/******************************************************************************************/
/** TYPE 3 OFFSET *************************************************************************/
/******************************************************************************************/

/**
 * Information used during a type 3 operation (jump)
 **/

static inline int16_t msp430_type3_offset(short insns)
{
  /*         5 4 3 2 1 0 9 8 7 6 5 4 3 2 1 0  */
  /* T3     [  op |  cc |       offset      ] */
  ASM_VAR();
  uint16_t decode_next_pc;
  int16_t  res;

  /* value          */
  res = insns & 0x3ff;
  /* sign extension */
  if (res & 0x200) 
    { 
      res |= ~0x3ff;
    }
  /* shift by one */
  res <<= 1;

  ASM_START(insns);
  ASM_ADD("%s $%s%d\n", 
	      msp430_debug_opcode((insns >> 8) & ~3,0), 
	      ((res + 2) > 0) ? "+" : "", res + 2);
  ASM_END();

  decode_next_pc = mcu_get_pc() + 2;
  mcu_set_pc_next(decode_next_pc);
#if defined(ETRACE)
  MCU_ALU.sequ_pc = decode_next_pc;
#endif
  return res;
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

/**
 * Addressing modes
 *
 * 00 Rn    Register mode
 * 01 X(Rn) Indexed mode
 * 01 EDE   Symbolic mode
 * 01 &EDE  Absolute mode
 * 10 @Rn   Indirect mode
 * 11 @Rn+  Indirect autoincrement
 * 11 #N    Immediate mode
 **/

#define SET_CYCLES(n)				\
  do {						\
    msp430_instruction_cycles = n;		\
  } while(0)

/**
 * Type 1 opcode timing
 *
 * Destination
 *    Rn PC X(Rn) EDE &EDE 
 *
 * static int opt1_cycles_class[7][5] = 
 *  {                    // source          
 *    { 1, 2, 4, 4, 4 }, // Rn     SRC_TIMING_0 
 *    { 2, 2, 5, 5, 5 }, // @Rn    SRC_TIMING_1 
 *    { 2, 3, 5, 5, 5 }, // @Rn+   SRC_TIMING_2 
 *    { 2, 3, 5, 5, 5 }, // #N     SRC_TIMING_2 
 *    { 3, 3, 6, 6, 6 }, // x(Rn)  SRC_TIMING_3 
 *    { 3, 3, 6, 6, 6 }, // EDE    SRC_TIMING_3 
 *    { 3, 3, 6, 6, 6 }, // &EDE   SRC_TIMING_3 
 *  }; 
 *
 *  source mode timing 
 *  Rn                                   --> SRC_TIMING_0
 *  @Rn                                  --> SRC_TIMING_1
 *  @Rn+, #N are always the same         --> SRC_TIMING_2 
 *  X(Rn), EDE, &EDE are always the same --> SRC_TIMING_3 
 *
 *  destination mode timing
 *  Rn                                   --> DST_TIMING_0 
 *  PC                                   --> DST_TIMING_1 
 *  X(Rn), EDE,&EDE are always the same  --> DST_TIMING_2 
 **/

static int opt1_cycles_class[4][3] = 
  {              // source          
    { 1, 2, 4 }, // SRC_TIMING_0 
    { 2, 2, 5 }, // SRC_TIMING_1 
    { 2, 3, 5 }, // SRC_TIMING_2 
    { 3, 3, 6 }, // SRC_TIMING_3 
  }; 


/**
 * Type 2 opcode timing 
 *
 * 00 Rn    Register mode           --> OPT2_TIMING_0
 * 10 @Rn   Indirect mode           --> OPT2_TIMING_1
 * 11 @Rn+  Indirect autoincrement  --> OPT2_TIMING_2
 * 11 #N    Immediate mode          --> OPT2_TIMING_3
 * 01 X(Rn) Indexed mode            --> OPT2_TINING_4
 * 01 EDE   Symbolic mode
 * 01 &EDE  Absolute mode
 *
 * X(Rn), EDE, &EDE are always the same --> OPT2_TIMING_
 *                                     Rn @Rn @Rn+ #N X(Rn) EDE &EDE 
 * static int opt2_cycles_class1[7] = {  1, 3,  3,  0,  4,   4,   4 }; // OP_RRA, OP_RRC, OP_SWPB, OP_SXT 
 * static int opt2_cycles_class2[7] = {  3, 4,  5,  4,  5,   5,   5 }; // OP_PUSH 
 * static int opt2_cycles_class3[7] = {  4, 4,  5,  5,  5,   5,   5 }; // OP_CALL 
 */

static int opt2_cycles_class1[5] = {  1, 3,  3,  0,  4 }; // OP_RRA, OP_RRC, OP_SWPB, OP_SXT 
static int opt2_cycles_class2[5] = {  3, 4,  5,  4,  5 }; // OP_PUSH 
static int opt2_cycles_class3[5] = {  4, 4,  5,  5,  5 }; // OP_CALL 


/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/
#if 0
((opt1.dst_mode == REG_MODE) ?						\
 (MCU_REGS[opt1.dst_reg]) :						\
 ((opt1.byte == 1) ? msp430_read_byte(opt1.dst_addr) & 0xff : msp430_read_short(opt1.dst_addr)))
#endif

static inline uint16_t READ_OPT1_DST()
{
  if (opt1.dst_mode == REG_MODE)
    {
      if (opt1.dst_reg == PC_REG_IDX)
	return  mcu_get_pc_next();
      else
	return MCU_REGS[opt1.dst_reg];
    }
  else if (opt1.byte == 1)
    {
      return msp430_read_byte(opt1.dst_addr) & 0xff;
    }
  else
    {
      return msp430_read_short(opt1.dst_addr); 
    }
}

