afrab/WSim/arch/msp430/msp430_alu.c
static inline void WRITE(int m, int b, int r, uint16_t a, int16_t res)
{
  if (m == REG_MODE)
    {
      if (r == PC_REG_IDX) /* PC */
	{
	  mcu_set_pc_next(res);
	  ETRACER_BRANCH(ETRACER_BRANCH_NONE);
	}
      else if (r == SR_REG_IDX) /* SR */
	{
	  if (RUNNING_MODE() != RUNNING_MODE_FROM_REG(res))
	    {
	      HW_DMSG_LPM("msp430:lpm: writing SR register, LPM changed 0x%x at PC 0x%04x\n",
			  RUNNING_MODE_FROM_REG(res),mcu_get_pc());
	      HW_DMSG_LPM("msp430:lpm:    new mode is (SCG1:%d,SCG0:%d,OSCOFF:%d,CPUOFF:%d)\n",
			  (res>>SHIFT_SCG1)&1,(res>>SHIFT_SCG0)&1,(res>>SHIFT_OSCOFF)&1,(res>>SHIFT_CPUOFF)&1);
	      MCU_CLOCK_SYSTEM_SPEED_TRACER();
	      // scg1:%d scg0:%d oscoff:%d cpuoff:%d\n", MCU_READ_SCG1,MCU_READ_SCG0,MCU_READ_OSCOFF,MCU_READ_CPUOFF);
	      mcu_signal_add(SIG_MCU_LPM_CHANGE);
	    }

	  if ((MCU_ALU.regs[r] & MASK_GIE) != (res & MASK_GIE))
	    {
	      HW_DMSG_GIE("msp430:intr: GIE bit %d -> %d at PC 0x%04x [%"PRIu64"]\n",
			   (MCU_ALU.regs[r] >> SHIFT_GIE)&1,
			   (res >> SHIFT_GIE)&1, mcu_get_pc(),
			   MACHINE_TIME_GET_NANO());
	      TRACER_TRACE_GIE((res >> SHIFT_GIE) & 1);
	    }
	}
      else if (r == SP_REG_IDX) /* SP */
	{
	  TRACER_TRACE_SP(SP);
	}
      MCU_ALU.regs[r] = res;
    }
  else
    {
      if (b==1)
	{
	  msp430_write_byte(a,res);
	}
      else
	{
	  msp430_write_short(a,res);
	}
    }
}

#define WRITE_OPT1 WRITE(opt1.dst_mode,opt1.byte,opt1.dst_reg,opt1.dst_addr,result)
#define WRITE_OPT2 WRITE(opt2.mode,opt2.byte,opt2.reg,opt2.addr,result)

#define BIT_MSB_MASK(b)   (b ? 0x80u : 0x8000u)
#define BIT_CARRY_MASK(b) (b ? 0xffffff00u : 0xffff0000u)
#define BIT_MASK(b)       (b ? 0x000000ffu : 0x0000ffffu)

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

unsigned int msp430_mcu_run_insn()
{
      uint16_t insn;
      unsigned int opcode;
      unsigned int msp430_instruction_cycles = 0; // used through SET_CYCLES(n)

#if DEBUG_ME_HARDER != 0
      uint16_t debug_SR = SR;
#endif

#if defined(ETRACE)
      MCU_ALU.etracer_nseq_flag        = MCU_ALU.next_pc != MCU_ALU.sequ_pc;
      MCU_ALU.etracer_seq_address      = MCU_ALU.sequ_pc;
      MCU_ALU.etracer_branch_type      = 0;
      MCU_ALU.etracer_reti             = 0;
#endif

      /* ********************************************************** */
      /* MCU_ALU.curr_pc is used through the function               */
      /* regs[PC] = PC_next, must be done at end of execution       */
      /* to maintain correct Debug information                      */
      /* ********************************************************** */
      
      MCU_ALU.curr_pc = MCU_ALU.regs[PC_REG_IDX] = MCU_ALU.next_pc;

      HW_DMSG_FD("msp430: -- Fetch start - 0x%04x ---------------------------------\n",MCU_ALU.curr_pc);

      /* fetch */
      insn = msp430_fetch_short(MCU_ALU.curr_pc);
      TRACER_TRACE_PC(MCU_ALU.curr_pc);
      if ((mcu_signal_get() & SIG_MAC) != 0)
	{
	  insn = 0x0000; /* extract_opcode will return 0; */
	  HW_DMSG_FD("msp430:alu:  Memory Access Control on fetch at 0x%04x\n",MCU_ALU.curr_pc);
	}

      /* decode */
      opcode = extract_opcode(insn);
      if ((mcu_signal_get() & SIG_MAC) != 0)
	{
	  HW_DMSG_FD("msp430:alu:  Memory Access Control on operand at 0x%04x\n",MCU_ALU.curr_pc);
	}

      /* execute */
      switch(opcode)
        {
	  /* ********************************************************************** */
	  /* *** SIGTRAP 0 and 1 ************************************************** */
	  /* ********************************************************************** */

	case 0x0:
	  mcu_signal_add(SIG_MCU | SIG_MCU_TRAP);
	  SET_CYCLES(0);
          switch (insn)
            {
	    case 0:
	      HW_DMSG_FD("msp430:alu:  MCU_SIGTRAP 0\n");
	      break;
	    case 1:
	      HW_DMSG_FD("msp430:alu:  MCU_SIGTRAP 1\n");
	      break;
	    default:
	      ERROR("msp430:alu: MCU_SIGTRAP %d (0x%04x) unknown\n",insn,insn);
	    }
	  return msp430_instruction_cycles;

	  	  
	  /* ********************************************************************** */
          /* *** SINLE OPERAND OPERATIONS ***************************************** */
	  /* ********************************************************************** */

	  /* flags : VNZC */
	  /* modes : OSCOFF CPUOFF GIE */

        case OP_RRA: 
	  {
	    int16_t result;
	    msp430_type2_single_operand( insn );
	    result = opt2.val;
	    result = (result & BIT_MSB_MASK(opt2.byte)) | ((result>>1) & (opt2.byte ? 0x7f : 0x7fff) );
	    WRITE_OPT2;
	    /* flags : 0*** */
	    CLR_V;
	    WRITE_N(result & BIT_MSB_MASK(opt2.byte));
	    WRITE_Z(result == 0);
	    WRITE_C(opt2.val & 1);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt2_cycles_class1[opt2.t_mode]);
	  }
          break;

        case OP_RRC:
	  {
	    int16_t result;
	    msp430_type2_single_operand( insn );
	    if (opt2.byte) /* 8 bits */
	      {
		result  = (((uint8_t)opt2.val) >> 1) | (READ_C << 7);
	      }
	    else
	      {
		result  = (((uint16_t)opt2.val) >> 1) | (READ_C << 15);
	      }
	    WRITE_OPT2;
	    /* flags : **** */
	    WRITE_V(!(opt2.val & BIT_MSB_MASK(opt2.byte)) && (READ_C));
	    WRITE_N(result & BIT_MSB_MASK(opt2.byte));
	    WRITE_Z(result == 0);
	    WRITE_C(opt2.val & 1);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt2_cycles_class1[opt2.t_mode]);
	  }
          break;

        case OP_SWPB:
	  {
	    int16_t result;
	    msp430_type2_single_operand( insn );
	    result = ((opt2.val << 8) & 0xff00) | ((opt2.val >> 8) & 0x00ff);
	    WRITE_OPT2;
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt2_cycles_class1[opt2.t_mode]);
	  }
          break;

        case OP_SXT: 
	  {
	    int16_t result;
	    msp430_type2_single_operand( insn );
	    result = opt2.val & 0xff;
	    if (result & 0x80) 
	      result |= 0xff00;
	    WRITE_OPT2;
	    /* flags : 0*** */
	    CLR_V;
	    WRITE_N(result & BIT_MSB_MASK(opt2.byte));
	    WRITE_Z(result == 0);
	    WRITE_C(result != 0);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt2_cycles_class1[opt2.t_mode]);
	  }
          break;

        case OP_PUSH:
	  {
	    int16_t result;
	    SP -= 2;
	    msp430_type2_single_operand( insn );
	    result = opt2.val;
	    msp430_write_short(SP,result);
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    TRACER_TRACE_SP(SP);
	    SET_CYCLES(opt2_cycles_class2[opt2.t_mode]);
	  }
          break;

        case OP_CALL:
	  {
	    uint16_t next_pc;
	    SP -= 2;
	    msp430_type2_single_operand( insn );
	    msp430_write_short(SP,mcu_get_pc_next());
	    next_pc = opt2.val;
	    mcu_set_pc_next(next_pc);
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    TRACER_TRACE_SP(SP);
	    SET_CYCLES(opt2_cycles_class3[opt2.t_mode]);
	    ETRACER_BRANCH(ETRACER_BRANCH_CALL);
	  }
          break;

        case OP_RETI:
	  {
	    // no need msp430_type2_single_operand( insn );
	    uint16_t oldSR = SR;
	    uint16_t next_pc;
	    SR = msp430_read_short(SP);
	    if (RUNNING_MODE() != RUNNING_MODE_FROM_REG(oldSR))
	    {
	      HW_DMSG_LPM("msp430:lpm: changed during stacked SR pop on RETI\n");
	      HW_DMSG_LPM("msp430:lpm:     from (SCG1:%d,SCG0:%d,OSCOFF:%d,CPUOFF:%d)\n",
			  (oldSR>>SHIFT_SCG1)&1,(oldSR>>SHIFT_SCG0)&1,(oldSR>>SHIFT_OSCOFF)&1,(oldSR>>SHIFT_CPUOFF)&1);
	      HW_DMSG_LPM("msp430:lpm:       to (SCG1:%d,SCG0:%d,OSCOFF:%d,CPUOFF:%d)\n",
			  (SR>>SHIFT_SCG1)&1,(SR>>SHIFT_SCG0)&1,(SR>>SHIFT_OSCOFF)&1,(SR>>SHIFT_CPUOFF)&1);
	      mcu_signal_add(SIG_MCU_LPM_CHANGE);
	    }
	    SP += 2;
	    next_pc = msp430_read_short(SP);
	    mcu_set_pc_next(next_pc);
	    SP += 2;
	    HW_DMSG_INTR("msp430:intr: return from interrupt at pc = 0x%04x new pc is 0x%04x [%"PRIu64"]\n",
			 MCU_ALU.curr_pc,next_pc, MACHINE_TIME_GET_NANO());
	    TRACER_TRACE_INTR(0);
	    /* flags : restored from the stack */
	    /* modes : restored from the stack */
	    /* cycle */
	    SET_CYCLES(5);

	    /* check interrupt that have been raised during the IRQ routine */
	    if (msp430_interrupt_checkifg())
	      {
		HW_DMSG_INTR("msp430:intr: == Return from interrupt with uncleared IFG, setting new interrupt\n");
	      }
	    TRACER_TRACE_SP(SP);
	    ETRACER_BRANCH(ETRACER_BRANCH_NONE);
	    MCU_ALU.etracer_reti = 1;
	  }
	  break;

	  /* ********************************************************************** */
          /* *** DOUBLE OPERAND OPERATIONS **************************************** */
	  /* ********************************************************************** */

	case OP_DADD:
	  {
	    int i, c, src, dst, b;
	    int16_t result;
	    msp430_type1_double_operands( insn );

