afrab/WSim/arch/msp430/msp430_alu.c
	    b = opt1.byte ? 2 : 4;
	    c = READ_C;
	    src = opt1.src_val;
	    dst = READ_OPT1_DST();

	    result = 0;
	    for(i=0; i < b; i++ )
	    {
	      short tmp = (src & 0xf) + (dst & 0xf) + c;
	      
	      if (tmp >= 10) 
		{
		  tmp -= 10;
		  c = 1;
		}
	      else
		{
		  c = 0;
		}
	      
	      src >>= 4;
	      dst >>= 4;
	      result |= tmp << (i*4);
	    }

	    WRITE_OPT1;
	    /* flags : **** */
	    //WRITE_V(); undefined
	    WRITE_N(result & BIT_MSB_MASK(opt1.byte));
	    WRITE_Z(result == 0);
	    WRITE_C(result > (opt1.byte ? 99 : 9999));
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
	  break;

	case OP_MOV: 
	  {
	    int16_t result;
	    msp430_type1_double_operands( insn );
	    result = opt1.src_val;
	    WRITE_OPT1;
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	    if (opt1.src_reg == opt1.dst_reg)
	      {
		switch (insn)
		  {
		  case 0x4404: /* mov r4,r4 */
		    etracer_start();
		    TRACER_TRACE_BKP(4);
		    WARNING("msp430: PC:0x%04x software internal mov 4 : etracer_start()\n",MCU_ALU.curr_pc & 0xffff); 
		    break;
		  case 0x4505: /* mov r5,r5 */
		    etracer_stop();
		    TRACER_TRACE_BKP(5);
		    WARNING("msp430: PC:0x%04x software internal mov 5 : etracer_stop()\n",MCU_ALU.curr_pc & 0xffff); 
		    break;
		  case 0x4606: /* mov r6,r6 */
		    TRACER_TRACE_BKP(6);
		    WARNING("msp430: PC:0x%04x software internal mov 6 : MCU TRAP\n",MCU_ALU.curr_pc & 0xffff); 
		    mcu_signal_add(SIG_MCU | SIG_MCU_TRAP);
		    SET_CYCLES(0);
		    return msp430_instruction_cycles;

		  case 0x4707: 
		    tracer_start();
		    TRACER_TRACE_BKP(7);
		    WARNING("msp430: PC:0x%04x software internal mov 7\n",MCU_ALU.curr_pc & 0xffff); 
		    break;
		  case 0x4808: 
		    tracer_stop();
		    TRACER_TRACE_BKP(8);
		    WARNING("msp430: PC:0x%04x software internal mov 8\n",MCU_ALU.curr_pc & 0xffff); 
		    break;

		  case 0x4909: WARNING("msp430: PC:0x%04x software internal mov 9\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP( 9); break;
		  case 0x4a0a: WARNING("msp430: PC:0x%04x software internal mov A\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(10); break;
		  case 0x4b0b: WARNING("msp430: PC:0x%04x software internal mov B\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(11); break;
		  case 0x4c0c: WARNING("msp430: PC:0x%04x software internal mov C\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(12); break;
		  case 0x4d0d: WARNING("msp430: PC:0x%04x software internal mov D\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(13); break;
		  case 0x4e0e: WARNING("msp430: PC:0x%04x software internal mov E\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(14); break;
		  case 0x4f0f: WARNING("msp430: PC:0x%04x software internal mov F\n",MCU_ALU.curr_pc & 0xffff); TRACER_TRACE_BKP(15); break;
		  }
	      }
	  }
          break;

        case OP_ADD: 
        case OP_ADDC:
	  {
	    int mask,msb,src,dst,result,C,addc,t1,t2;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    addc = ((opcode==OP_ADDC) ? READ_C : 0);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = src + dst + addc ;
	    C = (result & BIT_CARRY_MASK(opt1.byte)) != 0;
	    result = result & mask;

	    WRITE_OPT1;

	    /* flags : **** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    t1  = ((src & msb) == 0) && ((dst & msb) == 0) &&  (result & msb);       /* pos + pos = neg */
	    t2  =  (src & msb)       &&  (dst & msb)       && ((result & msb) == 0); /* neg + neg = pos */
	      
	    WRITE_V(t1 || t2);
	    WRITE_N(result & msb);
	    WRITE_Z(result == 0);
	    WRITE_C(C);

	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

        case OP_SUB:
        case OP_SUBC:
	  {
	    int mask,msb,src,dst,result,C,subc,t1,t2;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    subc = ((opcode==OP_SUBC) ? READ_C : 1);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = ((~src) & mask) + dst + subc;
	    C = (result & BIT_CARRY_MASK(opt1.byte)) != 0;
	    result  = result & mask;

	    WRITE_OPT1;

	    /* flags : **** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    t1  = ((src & msb) == 0) &&  (dst & msb)       && ((result & msb) == 0); /* neg - pos = pos */
	    t2  =  (src & msb)       && ((dst & msb) == 0) &&  (result & msb);       /* pos - neg = neg */
	      
	    WRITE_V(t1 || t2);
	    WRITE_N(result & msb);
	    WRITE_Z(result == 0);
	    WRITE_C(C);

	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

        case OP_CMP: /* OP_CMP is the same as SUB except for result storage */
	  {
	    int mask,msb,src,dst,result,C,t1,t2;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = ((~src) & mask) + dst + 1;
	    C = (result & BIT_CARRY_MASK(opt1.byte)) != 0;
	    result = result & mask;
	    
	    /* flags : **** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    t1  = ((src & msb) == 0) &&  (dst & msb)       && ((result & msb) == 0); /* neg - pos = pos */
	    t2  =  (src & msb)       && ((dst & msb) == 0) &&  (result & msb);       /* pos - neg = neg */

	    WRITE_V(t1 || t2);
	    WRITE_N(result &  msb);
	    WRITE_Z(result == 0);
	    WRITE_C(C);

	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

        case OP_BIC:
	  {
	    int mask,src,dst,result;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = (~src & dst) & mask;

	    WRITE_OPT1;
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

