afrab/WSim/arch/msp430/msp430_alu.c
        case OP_BIS:
	  {
	    int mask,src,dst,result;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = (src | dst) & mask;

	    WRITE_OPT1;
	    /* flags : ---- */
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
	  break;

        case OP_BIT:
	  { 
	    int mask,msb,src,dst,result;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = (src & dst) & mask;

	    /* flags : 0*** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    CLR_V;
	    WRITE_N(result & msb);
	    WRITE_Z(result == 0);
	    WRITE_C(result != 0);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

        case OP_XOR:
	  {
	    int mask,msb,src,dst,result;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = (src ^ dst) & mask;

	    WRITE_OPT1;
	    /* flags : **** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    WRITE_V((src & msb) && (dst & msb));
	    WRITE_N(result & msb);
	    WRITE_Z(result == 0);
	    WRITE_C(result != 0);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
          break;

        case OP_AND:
	  {
	    int mask,msb,src,dst,result;
	    msp430_type1_double_operands( insn );
	    mask = BIT_MASK(opt1.byte);
	    src  = opt1.src_val    & mask;
	    dst  = READ_OPT1_DST() & mask;

	    result = (src & dst) & mask;

	    WRITE_OPT1;
	    /* flags : 0*** */
	    msb = BIT_MSB_MASK(opt1.byte);
	    CLR_V;
	    WRITE_N(result & msb);
	    WRITE_Z(result == 0);
	    WRITE_C(result != 0);
	    /* modes : ---  */
	    /* cycles       */
	    SET_CYCLES(opt1_cycles_class[opt1.src_t_mode][opt1.dst_t_mode]);
	  }
	  break;
	    
	  /* ********************************************************************** */
          /* *** JUMP OPERATIONS ************************************************** */
	  /* ********************************************************************** */

        case OP_JNZ: /* OP_JNE */
	  {
	    int16_t offset = msp430_type3_offset(insn);
	    if (! READ_Z)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JZ: /* OP_JEQ */
	  {
	    int16_t offset = msp430_type3_offset(insn);
	    if (READ_Z)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JC: /* OP_JHS */
          {
	    int16_t offset = msp430_type3_offset(insn);
	    if (READ_C)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JNC: /* OP_JLO */
          {
	    int16_t offset = msp430_type3_offset(insn);
	    if (! READ_C)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
	  break;

        case OP_JN:
          {
	    int16_t offset = msp430_type3_offset(insn);
	    if (READ_N)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JGE:
          {
	    int16_t offset = msp430_type3_offset(insn);
	    if (!(READ_N^READ_V))
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JL:
          {
	    int16_t offset = msp430_type3_offset(insn);
	    if (READ_N^READ_V)
	      {
		uint16_t next_pc = mcu_get_pc_next() + offset;
		mcu_set_pc_next(next_pc);
		ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	      }
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

        case OP_JMP:
	  {
	    /* 
	     * do NOT remove temporary offset variable unless you really
	     * know what you are doing 
	     */
	    int16_t offset   = msp430_type3_offset(insn);
	    uint16_t next_pc = mcu_get_pc_next() + offset;
	    mcu_set_pc_next(next_pc);
	    ETRACER_BRANCH(ETRACER_BRANCH_JUMP);
	    /* flags : ---- */
	    SET_CYCLES(2);
	  }
          break;

	  /* ********************************************************************** */
	  /* ********************************************************************** */
	  /* ********************************************************************** */

        default:
          ERROR("msp430:alu: Unknown opcode 0x%04x at 0x%04x\n", insn, MCU_ALU.curr_pc);
	  SET_CYCLES(0);
	  mcu_signal_add(SIG_MCU | SIG_MCU_ILL);
	  return msp430_instruction_cycles;

        } /* case OP_*/


      /* PC = PC_next, must be done at end of execution to keep Debug correct */
      MCU_ALU.regs[PC_REG_IDX] = MCU_ALU.next_pc;
#if defined(DEBUG) && defined(DEBUG_REGISTERS)
      msp430_print_registers(4);
#endif
      HW_DMSG_FD("msp430: -- Fetch end --------------------------------------------\n");

      /* statistics */
      MCU_INSN_CPT  += 1;
      MCU_CYCLE_CPT += msp430_instruction_cycles;
#if DEBUG_DISASSEMBLE != 0 || DEBUG_SYSTEM_TIME != 0
      HW_DMSG_MCU("msp430: add %d cycles\n", msp430_instruction_cycles);
#endif


#if DEBUG_ME_HARDER != 0
      if (((debug_SR & MASK_GIE) == 0) && ((SR & MASK_GIE) == MASK_GIE))
	{
	  HW_DMSG_INTR("msp430:intr:debug: GIE set back to 1 at PC=0x%04x\n",
	               MCU_ALU.curr_pc);
	  TRACER_TRACE_GIE(1);
	}
#endif

#if defined(ETRACE)
      etracer_slot_insn(MCU_ALU.curr_pc, /* WARNING : MSB problem when uin16_t -> uint32_t */
                        msp430_insn_class(opcode),
                        msp430_instruction_cycles,
                        MCU_ALU.etracer_nseq_flag,     /* previous instruction was a jump      */
			MCU_ALU.etracer_seq_address,   /* sequential exec would have been here */
			MCU_ALU.etracer_branch_type,
			MCU_ALU.etracer_except,
			MCU_ALU.etracer_reti);
#endif

      return msp430_instruction_cycles;
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/

unsigned int msp430_mcu_run_lpm(void)
{
#define LPM_UPDATE_CYCLES 4
  etracer_slot_set_pc( MCU_ALU.curr_pc );
  return LPM_UPDATE_CYCLES;
}

/******************************************************************************************/
/******************************************************************************************/
/******************************************************************************************/
